app/Controllers/Admin/Project.php

    public function index(): string
    {
        $projects = [];
        try {
            $projects = $this->projectModel->orderBy('created_at', 'DESC')->findAll();
---
SELECT *
FROM `projects`
ORDER BY `created_at` DESC

        ];

        try {
            $this->projectModel->insert($saveData);
---
INSERT INTO `projects` (`title`, `description`, `technologies`, `github`, `demo`, `category`, `status`, `thumbnail`, `created_at`, `updated_at`) VALUES ('project website', 'Deskripsi proyek adalah dokumen ringkas yang menjelaskan tujuan, ruang lingkup, dan hasil akhir dari suatu rencana kerja. Dokumen ini berfungsi sebagai panduan utama agar semua anggota tim dan pihak terkait memiliki pemahaman yang sama.Komponen UtamaTujuan: Alasan mengapa proyek ini dibuat dan masalah yang ingin diselesaikan.Ruang Lingkup: Batasan, area kerja, serta hal-hal yang termasuk atau tidak termasuk dalam proyek.Jadwal dan Hasil: Perkiraan waktu pengerjaan dan bentuk hasil akhir yang akan dicapai.Jika Anda ingin membuat deskripsi proyek, beri tahu saya:Apa jenis atau topik proyek Anda?Siapa target atau pengguna akhir proyek ini?Saya bisa membantu menyusun draf deskripsinya untuk Anda.', '[\"HTML\",\"CSS\",\"Bootstrap\",\"Git\"]', 'https://github.com/Faiq-DataSci/website-portofolio', '', 'Web Development', 'published', '1785229214_160ac0ec91de3e02eb82.jpg', '2026-07-28 09:00:14', '2026-07-28 09:00:14')