app/Controllers/Projects.php

    public function detail($id)
    {
        try {
            $project = $this->projectModel->find($id);
---
SELECT *
FROM `projects`
WHERE `projects`.`id` = '5'