app/Models/SkillModel.php

SELECT *
FROM `skills`
WHERE `status` = 'active'
ORDER BY `category` ASC, `order_index` ASC
---
    public function getActiveSkills()
    {
        try {
            return $this->where('status', 'active')
                        ->orderBy('category', 'ASC')
                        ->orderBy('order_index', 'ASC')
                        ->findAll();