app/Models/UserModel.php

    public function getUserByUsernameOrEmail(string $identifier)
    {
        try {
            return $this->where('username', $identifier)
                        ->orWhere('email', $identifier)
                        ->first();
---
SELECT *
FROM `users`
WHERE `username` = 'admin'
OR `email` = 'admin'
 LIMIT 1